app/Controllers/Nomina.php

SELECT `nomina`.*, `usuarios`.`nombre` as `nombre_empleado`, `usuarios`.`usuario` as `nombre_usuario`
FROM `nomina`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `nomina`.`id_empleado`
WHERE `nomina`.`mes` LIKE '%Gabriel%' ESCAPE '!'
OR  `usuarios`.`nombre` LIKE '%Gabriel%' ESCAPE '!'
OR  `usuarios`.`usuario` LIKE '%Gabriel%' ESCAPE '!'
ORDER BY `nomina`.`mes` DESC
---
    public function index()
    {
        // 1. AUTORIZACIÓN: Solo permitir acceso a 'admin'
        if ($this->session->get('rol') !== 'admin') {
            $this->session->setFlashdata('msg', 'Acceso denegado. No tienes permisos para ver la Nómina.');
            return redirect()->to(base_url('menu'));
        }

        // 2. LÓGICA DE BÚSQUEDA
        $searchQuery = $this->request->getGet('q'); // Obtener el parámetro de búsqueda 'q'

        if ($searchQuery) {
            // Si hay término de búsqueda, filtramos.
            $nominas = $this->nominaModel->select('nomina.*, usuarios.nombre as nombre_empleado, usuarios.usuario as nombre_usuario')
                                         ->join('usuarios', 'usuarios.id_usuario = nomina.id_empleado')
                                         ->orLike('nomina.mes', $searchQuery)
                                         ->orLike('usuarios.nombre', $searchQuery)
                                         ->orLike('usuarios.usuario', $searchQuery)
                                         ->orderBy('nomina.mes', 'DESC')
                                         ->findAll();

SELECT `id_usuario`, `nombre`, `usuario`
FROM `usuarios`
---
    public function create()
    {
        if ($this->session->get('rol') !== 'admin') {
            $this->session->setFlashdata('msg', 'Acceso denegado.');
            return redirect()->to(base_url('menu'));
        }

        // Obtener la lista de usuarios (empleados) para el desplegable
        $empleados = $this->userModel->select('id_usuario, nombre, usuario')->findAll();