app/Models/BonificacionModel.php

SELECT `bonificacion`.*, `e`.`nombre` AS `nombre_empleado`, `e`.`apellido` AS `apellido_empleado`
FROM `bonificacion`
JOIN `empleados` `e` ON `e`.`id_empleado` = `bonificacion`.`id_empleado`
---
    public function getBonificacionesConEmpleado()
    {
        return $this->select('bonificacion.*, e.nombre AS nombre_empleado, e.apellido AS apellido_empleado')
                    ->join('empleados e', 'e.id_empleado = bonificacion.id_empleado')
                    ->findAll();