app/Models/NominaModel.php

SELECT `nomina`.*, `empleados`.`nombre` as `nombre_empleado`, `usuarios`.`usuario` as `nombre_usuario`
FROM `nomina`
JOIN `empleados` ON `empleados`.`id_empleado` = `nomina`.`id_empleado`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `empleados`.`id_usuario`
ORDER BY `nomina`.`mes` DESC
---
    public function getNominaConEmpleado()
    {
        return $this->db->table($this->table)
            ->select('
                nomina.*,
                empleados.nombre as nombre_empleado,
                usuarios.usuario as nombre_usuario
            ')
            ->join('empleados', 'empleados.id_empleado = nomina.id_empleado')
            ->join('usuarios', 'usuarios.id_usuario = empleados.id_usuario')
            ->orderBy('nomina.mes', 'DESC')
            ->get()
            ->getResultArray();